[
        {
        "id": 1,
        "title": "FitLife",
        "stack": ["FLUTTER"],
        "description": "FitLife is a simple Progressive Web Application (PWA) that aims to assist users in maintaining their fitness by offering various shortcut tools in one place. Currently under development, the application already provides features such as calculating the Body Mass Index (BMI) of an individual. As development progresses, additional functionalities and tools are expected to be added to enhance the user's fitness experience.",
        "link": "https://fitlifeweb.netlify.app/",
        "code": "https://github.com/Krishnaraj017/FitLife"
    },
    {
        "id": 2,
        "title": "MITE-CHATBOT",
        "stack": ["JAVA", "XML", "ANDROID-STUDIO"],
        "description": "Chatbot app which helps users to get everything they needed to know about Mangalore Institute of Technology.",
        "link": "https://github.com/Krishnaraj017/MITE-Chatbot",
        "code": "https://github.com/Krishnaraj017/MITE-Chatbot"
    },
        {
        "id": 3,
        "title": "JOB-FINDER",
        "stack": ["REACT NATIVE", "EXPO", "RAPIDAPI"],
        "description": "The app offers comprehensive job search functionality, empowering users to find employment opportunities that match their preferences. With customizable filters, users can refine their search based on criteria such as  industry, job type. The platform also allows users to save job listings of interest for future reference, enabling them to easily revisit and review them later.",
        "link": "https://github.com/Krishnaraj017/Job-Finder-App",
        "code": "https://github.com/Krishnaraj017/Job-Finder-App"
    },
    {
        "id": 4,
        "title": "QUIZ GAME",
        "stack": ["NODE.JS", "NODE PACKAGE MANAGER(NPM)", "JAVASCRIPT"],
        "description": "This is a Node.js CLI game built with Inquirer library where you get to answer a series of JavaScript-related questions, You win the game by answering all the questions correctly.",
        "link": "https://github.com/Krishnaraj017/CLI-Game-Node.js-",
        "code": "https://github.com/Krishnaraj017/CLI-Game-Node.js-"
    },
    {
        "id": 5,
        "title": "EMOTION EYE",
        "stack": ["ANDROID-STUDIO", "KOTLIN", "FIREBASE ML"],
        "description": "EmotionEye is an emotion detection application, especially smile and it is built using Firebase ML Kit and Kotlin. It leverages the power of machine learning to analyze and identify human emotions from images accurately. With EmotionEye, you can gain valuable insights into the emotional states of individuals, enabling you to develop applications in various domains such as market research, customer feedback analysis, and human-computer interaction.",
        "link": "https://github.com/Krishnaraj017/EmotionEye",
        "code": "https://github.com/Krishnaraj017/EmotionEye"
    },

        {
        "id": 6,
        "title": "CHATBOT FOR BUSINESS WORK",
        "stack": ["ANDROID-STUDIO", "FIREBASE", "JAVA", "BRAINSHOP API"],
        "description": "The chatbot interprets the user's input, understands the context and intent, and generates relevant responses accordingly. It can answer questions, provide recommendations, perform tasks, offer customer support, and even engage in casual conversations.",
        "link": "https://github.com/Krishnaraj017/ChatBot-App",
        "code": "https://github.com/Krishnaraj017/ChatBot-App"
    },
    {
        "id": 7,
        "title": "CHAT-GPT",
        "stack": ["FLUTTER", "OPEN-AI"],
        "description": "ChatGPT App is a simple mobile application built on Flutter, which allows users to chat with an AI-powered conversational agent called ChatGPT. ChatGPT is a language model trained by OpenAI, based on the GPT-3.5 architecture, which can understand and respond to natural language input.",
        "link": "https://github.com/Krishnaraj017/ChatGPT-App",
        "code": "https://github.com/Krishnaraj017/ChatGPT-App"
    },
        {
        "id": 8,
        "title": "OBJECT MOTION DETECTOR",
        "stack": ["Python", "OpenCV", "Pandas"],
        "description": "This project detects motion in a video stream from a webcam and generates a CSV file with the start and end times of each motion event.",
        "link": "https://github.com/Krishnaraj017/Object-Motion-detector",
        "code": "https://github.com/Krishnaraj017/Object-Motion-detector"
    },
         {
        "id": 9,
        "title": "EMOTION DETECTOR",
        "stack": ["Python", "OpenCV", "Keras", "TensorFlow"],
        "description": "This project is an implementation of Emotion Detection using Keras, AI, and Python. It uses a deep neural network (DNN) to analyze facial expressions and detect the emotion being displayed. The DNN is trained on a dataset of images labeled with the four basic emotions: happy, sad, angry, surprised.",
        "link": "https://github.com/Krishnaraj017/Emotion-Detector",
        "code": "https://github.com/Krishnaraj017/Emotion-Detector"
    },
     {
        "id": 10,
        "title": "AUTO V CARD",
        "stack": ["HTML", "CSS", "FLASK", "MYSQL", "PHP", "APACHE"],
        "description": "Auto V Card is a web application that enables users to manage and retrieve their RTO data in a PDF format. It provides a convenient way to store and organize vehicle-related information using a user-friendly interface.",
        "link": "https://github.com/Krishnaraj017/AutoVcard",
        "code": "https://github.com/Krishnaraj017/AutoVcard"
    },
     {
        "id": 11,
        "title": "TOURISM EXPERIENCE",
        "stack": ["HTML", "CSS", "JAVASCRIPT"],
        "description": "Website for Tourists.",
        "link": "https://tourismnexpr.netlify.app/",
        "code": "https://github.com/Krishnaraj017/TOURISM-AND-EXPERIENCE"
    },
    {
        "id": 12,
        "title": "FIND MY PG",
        "stack": ["REACT NATIVE", "EXPO"],
        "description": "Find My PG App is a mobile application designed to assist college students in finding nearby rental rooms or paying for guest accommodations. Whether you're a student moving to a new city or searching for a better living arrangement, this app simplifies the process by providing a platform to discover suitable options conveniently.",
        "link": "https://github.com/Krishnaraj017/Pg-Finder-App",
        "code": "https://github.com/Krishnaraj017/Pg-Finder-App"
    }
]
